In [1]:
#Installing pandas
#importing pandas
#Data types in pandas

In [29]:
#Table of content
#1. DATA TYPES IN PANDAS
#2. MISSING DATA
#3. GROUP BY
#4. MERGING,JOINING AND CONCATENATING
#5. OPERATIONS
#6. DATA INPUT AND OUTPUT

In [140]:
#Some important function for dataframes
#1 . type()
#2. shape
#3. head()
#4. tail()
#5. columns
#6. describe()
#7. index

In [2]:
#DataTypes
#1. Series 1-dimensional
#2. DataFrames

In [146]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [6]:
labels=["a","b","c"]
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':10,'b':20,'c':30}

In [28]:
#series
pd.Series(data=my_data)

#Series may be 
#1. Python List
#2. Numpy array
#3. Dictionaries
#4. First argument is Data and other arugument is index(optinal)
#5. Series may of any data type of python
#6. Series is accessed by the help of Index and most of operaton of series is based upon index Ex: Arithmetic

0    10
1    20
2    30
dtype: int64

In [9]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [12]:
pd.Series(arr)#we can pass index here

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [14]:
pd.Series(data=labels)

0    a
1    b
2    c
dtype: object

In [26]:
ser1=pd.Series([1,2,3,4,5],['USA','Germany','USSR','JAPAN',"England"])
ser1

USA        1
Germany    2
USSR       3
JAPAN      4
England    5
dtype: int64

In [24]:
ser2=pd.Series([5,6,7,8,3],["Italy","India","Pakistan","Turkey","England"])
ser2

Italy       5
India       6
Pakistan    7
Turkey      8
England     3
dtype: int64

In [20]:
ser1['USA']

1

In [27]:
ser1+ser2

England     8.0
Germany     NaN
India       NaN
Italy       NaN
JAPAN       NaN
Pakistan    NaN
Turkey      NaN
USA         NaN
USSR        NaN
dtype: float64

In [30]:
# DATAFRAMES
# WAYS OF CREATING DATAFRAMES
#1. USING CSV
#2. USING EXCEL
#3. FROM PYTHON DICTIONARY
#4. FROM LIST OF TUPLES
#5. FROM LIST OF DICTIONARY

In [32]:
np.random.seed(101)

In [72]:
df=pd.DataFrame(rand(5,4),['A','B','C','D','E'],['W','X','Y','Z'])
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [73]:
#There are two ways to access
df['W']

A    0.097146
B    0.159560
C    0.701371
D    0.043397
E    0.500117
Name: W, dtype: float64

In [74]:
type(df['W'])

pandas.core.series.Series

In [40]:
#not recommended due to many function are accessed by same way
df.W

A    0.685306
B    0.186967
C    0.734819
D    0.402998
E    0.865100
Name: W, dtype: float64

In [75]:
#multiple column
df[['W','X']]

          W         X
A  0.097146  0.102847
B  0.159560  0.275573
C  0.701371  0.487635
D  0.043397  0.223937
E  0.500117  0.138010

In [76]:
#creation of new column
df['New']=df['W']+df['Z']
df

          W         X         Y         Z       New
A  0.097146  0.102847  0.701507  0.890480  0.987626
B  0.159560  0.275573  0.672492  0.164303  0.323863
C  0.701371  0.487635  0.680678  0.521548  1.222919
D  0.043397  0.223937  0.575205  0.120434  0.163830
E  0.500117  0.138010  0.052808  0.178277  0.678394

In [80]:
#droping column
# If we drop any column we need to pass axis=1 (axis=1 means column And axis=0 means row)
#if we did not pass inplace argument that time it gives new dataframe or if pass it modify the original one
df.drop('New',axis=1,inplace=True)

In [77]:
df

          W         X         Y         Z       New
A  0.097146  0.102847  0.701507  0.890480  0.987626
B  0.159560  0.275573  0.672492  0.164303  0.323863
C  0.701371  0.487635  0.680678  0.521548  1.222919
D  0.043397  0.223937  0.575205  0.120434  0.163830
E  0.500117  0.138010  0.052808  0.178277  0.678394

In [78]:
#drop the row
df.drop('E')

          W         X         Y         Z       New
A  0.097146  0.102847  0.701507  0.890480  0.987626
B  0.159560  0.275573  0.672492  0.164303  0.323863
C  0.701371  0.487635  0.680678  0.521548  1.222919
D  0.043397  0.223937  0.575205  0.120434  0.163830

In [81]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [82]:
df.shape

(5, 4)

In [85]:
#selecting rows
# Two Ways of selecting rows
#By passing string if index is string based
df.loc['E']

W    0.500117
X    0.138010
Y    0.052808
Z    0.178277
Name: E, dtype: float64

In [88]:
#if row value is not string then pass in iloc
df.iloc[4]

W    0.500117
X    0.138010
Y    0.052808
Z    0.178277
Name: E, dtype: float64

In [91]:
#Subset of rows and column like numpy
df.loc['D','Y']

0.575205086868013

In [92]:
df.loc[['A','B','C'],['W','Y']]

          W         Y
A  0.097146  0.701507
B  0.159560  0.672492
C  0.701371  0.680678

In [102]:
testdf=df*10

In [108]:
#conditinal selection
booldf=testdf>1
df[booldf]
# df[df['W']>0]
#same opertion we can do for column
df[testdf['Z']>1]

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [111]:
#This conditinal expression we can find in multiple steps also
df[df['W']>0][['Y','X']]

          Y         X
A  0.701507  0.102847
B  0.672492  0.275573
C  0.680678  0.487635
D  0.575205  0.223937
E  0.052808  0.138010

In [114]:
boolser=df['W']>0
result=df[boolser]
mycols=['Y','X']
result[mycols]

          Y         X
A  0.701507  0.102847
B  0.672492  0.275573
C  0.680678  0.487635
D  0.575205  0.223937
E  0.052808  0.138010

In [124]:
# use multiple conditions
# don't use 'and' keyword use & instead of that 
#for 'or' use |
df[(df['W']>0) & (df['Y']>0.7)]

          W         X         Y        Z
A  0.097146  0.102847  0.701507  0.89048

In [125]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [130]:
#index
#reset the index inplace we can use here also
df.reset_index()

  index         W         X         Y         Z
0     A  0.097146  0.102847  0.701507  0.890480
1     B  0.159560  0.275573  0.672492  0.164303
2     C  0.701371  0.487635  0.680678  0.521548
3     D  0.043397  0.223937  0.575205  0.120434
4     E  0.500117  0.138010  0.052808  0.178277

In [129]:
df

          W         X         Y         Z
A  0.097146  0.102847  0.701507  0.890480
B  0.159560  0.275573  0.672492  0.164303
C  0.701371  0.487635  0.680678  0.521548
D  0.043397  0.223937  0.575205  0.120434
E  0.500117  0.138010  0.052808  0.178277

In [131]:
#new Index
newind='CA NY WY OR CO'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CO']

In [134]:
df['States']=newind
df

          W         X         Y         Z States
A  0.097146  0.102847  0.701507  0.890480     CA
B  0.159560  0.275573  0.672492  0.164303     NY
C  0.701371  0.487635  0.680678  0.521548     WY
D  0.043397  0.223937  0.575205  0.120434     OR
E  0.500117  0.138010  0.052808  0.178277     CO

In [137]:
df.set_index('States',inplace=True)

In [138]:
df

               W         X         Y         Z
States
CA      0.097146  0.102847  0.701507  0.890480
NY      0.159560  0.275573  0.672492  0.164303
WY      0.701371  0.487635  0.680678  0.521548
OR      0.043397  0.223937  0.575205  0.120434
CO      0.500117  0.138010  0.052808  0.178277

In [139]:
df.index

Index(['CA', 'NY', 'WY', 'OR', 'CO'], dtype='object', name='States')

In [141]:
#Multi index and Index hierarchy
# Index Level
outside=['G1','G1','G1','G2','G2','G2']
inside=[1,2,3,1,2,3]
hier_index=list(zip(outside,inside))
hier_index=pd.MultiIndex.from_tuples(hier_index)

In [144]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [142]:
outside

['G1', 'G1', 'G1', 'G2', 'G2', 'G2']

In [143]:
inside

[1, 2, 3, 1, 2, 3]

In [148]:
df=pd.DataFrame(randn(6,2),hier_index,['A','B'])
df

             A         B
G1 1 -0.925874  1.862864
   2 -1.133817  0.610478
   3  0.386030  2.084019
G2 1 -0.376519  0.230336
   2  0.681209  1.035125
   3 -0.031160  1.939932

In [151]:
df.loc['G1'].loc[1]

A   -0.925874
B    1.862864
Name: 1, dtype: float64

In [152]:
df.index.names

FrozenList([None, None])

In [153]:
df.index.names=['Groups','Names']

In [154]:
df

                     A         B
Groups Names
G1     1     -0.925874  1.862864
       2     -1.133817  0.610478
       3      0.386030  2.084019
G2     1     -0.376519  0.230336
       2      0.681209  1.035125
       3     -0.031160  1.939932

In [155]:
df.loc['G2'].loc[2]['B']

1.0351250747739213

In [161]:
#mulilevel index --Cross section
df.xs(1,level='Names')

               A         B
Groups
G1     -0.925874  1.862864
G2     -0.376519  0.230336

In [168]:
#Missing Data
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}
df1=pd.DataFrame(d)
df1

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [170]:
#remove the where Nan is present by defalut , if we pass argument for column axis=1
df1.dropna()

     A    B  C
0  1.0  5.0  1

In [172]:
# remove column
df1.dropna(axis=1)

   C
0  1
1  2
2  3

In [175]:
# we can set threshold value for NaN present in row
df1.dropna(thresh=2)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [177]:
#filling the missing value
df1.fillna(value='Fill Value')

            A           B  C
0           1           5  1
1           2  Fill Value  2
2  Fill Value  Fill Value  3

In [179]:
df1['A'].fillna(value=df1['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [182]:
# GroupBy

data={'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],'Person':['SAM','AMIT','MOHIT','ROHIT','CARL','SARAH'],'Sales':[200,120,340,124,243,350]}
df2=pd.DataFrame(data)
df2

  Company Person  Sales
0    GOOG    SAM    200
1    GOOG   AMIT    120
2    MSFT  MOHIT    340
3    MSFT  ROHIT    124
4      FB   CARL    243
5      FB  SARAH    350

In [187]:
bycomp=df2.groupby('Company')
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [188]:
bycomp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [189]:
bycomp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [190]:
bycomp.sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [191]:
df2.groupby('Company').sum().loc['FB']

Sales    593
Name: FB, dtype: int64

In [192]:
df2.groupby('Company').count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [193]:
df2.groupby('Company').max()

        Person  Sales
Company
FB       SARAH    350
GOOG       SAM    200
MSFT     ROHIT    340

In [194]:
df2.groupby('Company').min()

        Person  Sales
Company
FB        CARL    243
GOOG      AMIT    120
MSFT     MOHIT    124

In [202]:
df2.groupby('Company').describe()

        Sales
        count   mean         std    min     25%    50%     75%    max
Company
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [216]:
#merging , joining and concatenating
first_df=pd.DataFrame({
    'A':['A0','A1','A2','A3'],
    'B':['B0','B1','B2','B3'],
    'C':['C0','C1','C2','C3'],
    'D':['D0','D1','D2','D3']},
index=[0,1,2,3])

In [222]:
second_df=pd.DataFrame({
    'A':['A4','A5','A6','A7'],
    'B':['B4','B5','B6','B7'],
    'C':['C4','C5','C6','C7'],
    'D':['D4','D5','D6','D7'],
    
},index=[4,5,6,7])

In [223]:
third_df=pd.DataFrame({
    'A':['A8','A9','A10','A11'],
    'B':['B8','B9','B10','B11'],
    'C':['C8','C9','C10','C11'],
    'D':['D8','D9','D10','D11'],
    
},index=[8,9,10,11])

In [226]:
first_df

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

In [227]:
second_df

    A   B   C   D
4  A4  B4  C4  D4
5  A5  B5  C5  D5
6  A6  B6  C6  D6
7  A7  B7  C7  D7

In [228]:
third_df

      A    B    C    D
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [232]:
#concatinating and merging and joining
pd.concat([first_df,second_df,third_df])

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [234]:
# Mostly we will join column not row
pd.concat([first_df,second_df,third_df],axis=1)

      A    B    C    D    A    B    C    D    A    B    C    D
0    A0   B0   C0   D0  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
1    A1   B1   C1   D1  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
2    A2   B2   C2   D2  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
3    A3   B3   C3   D3  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN
4   NaN  NaN  NaN  NaN   A4   B4   C4   D4  NaN  NaN  NaN  NaN
5   NaN  NaN  NaN  NaN   A5   B5   C5   D5  NaN  NaN  NaN  NaN
6   NaN  NaN  NaN  NaN   A6   B6   C6   D6  NaN  NaN  NaN  NaN
7   NaN  NaN  NaN  NaN   A7   B7   C7   D7  NaN  NaN  NaN  NaN
8   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A8   B8   C8   D8
9   NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN   A9   B9   C9   D9
10  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A10  B10  C10  D10
11  NaN  NaN  NaN  NaN  NaN  NaN  NaN  NaN  A11  B11  C11  D11

In [246]:
left=pd.DataFrame({'key':['K0','K1','K2','K3'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

right=pd.DataFrame({'key':['K0','K1','K2','K3'],
                   'C':['C0','C1','C2','C3'],
                   'D':['D0','D1','D2','D3']})

In [247]:
right

  key   C   D
0  K0  C0  D0
1  K1  C1  D1
2  K2  C2  D2
3  K3  C3  D3

In [248]:
left

  key   A   B
0  K0  A0  B0
1  K1  A1  B1
2  K2  A2  B2
3  K3  A3  B3

In [249]:
# Merging
# Default
pd.merge(left,right,how='inner',on='key')

  key   A   B   C   D
0  K0  A0  B0  C0  D0
1  K1  A1  B1  C1  D1
2  K2  A2  B2  C2  D2
3  K3  A3  B3  C3  D3

In [251]:
left=pd.DataFrame({'key1':['K0','K0','K1','K2'],
                  'key2':['K0','K1','K0','K1'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})
right=pd.DataFrame({'key1':['K0','K1','K1','K2'],
                  'key2':['K0','K0','K0','K0'],
                  'A':['A0','A1','A2','A3'],
                  'B':['B0','B1','B2','B3']})

In [252]:
left

  key1 key2   A   B
0   K0   K0  A0  B0
1   K0   K1  A1  B1
2   K1   K0  A2  B2
3   K2   K1  A3  B3

In [254]:
right

  key1 key2   A   B
0   K0   K0  A0  B0
1   K1   K0  A1  B1
2   K1   K0  A2  B2
3   K2   K0  A3  B3

In [255]:
#inner
pd.merge(left,right,on=['key1','key2'])

  key1 key2 A_x B_x A_y B_y
0   K0   K0  A0  B0  A0  B0
1   K1   K0  A2  B2  A1  B1
2   K1   K0  A2  B2  A2  B2

In [256]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1 key2  A_x  B_x  A_y  B_y
0   K0   K0   A0   B0   A0   B0
1   K0   K1   A1   B1  NaN  NaN
2   K1   K0   A2   B2   A1   B1
3   K1   K0   A2   B2   A2   B2
4   K2   K1   A3   B3  NaN  NaN
5   K2   K0  NaN  NaN   A3   B3

In [257]:
pd.merge(left,right,on=['key1','key2'],how='right')

  key1 key2  A_x  B_x A_y B_y
0   K0   K0   A0   B0  A0  B0
1   K1   K0   A2   B2  A1  B1
2   K1   K0   A2   B2  A2  B2
3   K2   K0  NaN  NaN  A3  B3

In [258]:
pd.merge(left,right,on=['key1','key2'],how='left')

  key1 key2 A_x B_x  A_y  B_y
0   K0   K0  A0  B0   A0   B0
1   K0   K1  A1  B1  NaN  NaN
2   K1   K0  A2  B2   A1   B1
3   K1   K0  A2  B2   A2   B2
4   K2   K1  A3  B3  NaN  NaN

In [269]:
# Joining 
# Joining is a convenient method for combining the colums of two potrntially diffrently-indexed DataFrame into a single result DataFrame.
left=pd.DataFrame({
    'A':['A0','A1','A2'],
    'B':['B0','B1','B2']
},index=['K0','K1','K2'])
right=pd.DataFrame({
    'C':['C0','C2','C3'],
    'D':['D0','D2','D3']
},index=['K0','K2','K3'])

In [270]:
left

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2

In [271]:
right

     C   D
K0  C0  D0
K2  C2  D2
K3  C3  D3

In [272]:
left.join(right)

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [273]:
left.join(right,how='outer')

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C2   D2
K3  NaN  NaN   C3   D3

In [274]:
left.join(right,how='left')

     A   B    C    D
K0  A0  B0   C0   D0
K1  A1  B1  NaN  NaN
K2  A2  B2   C2   D2

In [275]:
left.join(right,how='right')

      A    B   C   D
K0   A0   B0  C0  D0
K2   A2   B2  C2  D2
K3  NaN  NaN  C3  D3

In [279]:
#Operations
df=pd.DataFrame({
    'col1':[1,2,3,4],
    'col2':[444,555,666,777],
    'col3':['abc','def','ghi','xyz']
})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [280]:
#unique value
df['col2'].unique()

array([444, 555, 666, 777])

In [282]:
#len(df['col2'].unique())
df['col2'].nunique()

4

In [283]:
df['col2'].value_counts()

444    1
555    1
666    1
777    1
Name: col2, dtype: int64

In [286]:
#selecting data
df[df['col1']>2]

   col1  col2 col3
2     3   666  ghi
3     4   777  xyz

In [287]:
df['col1']>2

0    False
1    False
2     True
3     True
Name: col1, dtype: bool

In [288]:
# And --& , or |
#Apply
def times2(x):
    return x*2

In [289]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [292]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [293]:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3    1554
Name: col2, dtype: int64

In [294]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [295]:
# inplace
df.drop('col1',axis=1,)

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   777  xyz

In [296]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [297]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [302]:
df.sort_values(by='col2')

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   777  xyz

In [303]:
df.isnull()

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

In [306]:
data={'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
     'C':['x','y','x','y','x','y'],
     'D':[1,3,2,5,4,1]}
df=pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [310]:
#pivot table
df.pivot_table(values='D',index=['A','B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [313]:
#Data input and output
#1. CSV
#2. Excel
#3. HTML
#4. SQL
#------------------------------Install ------------
# pip install sqlalchemy
# pip install lxml
# pip install html5lib
# pip install beautifulsoup4

# CSV File open and read